In this project you are trying out for an online marketplace company. The evaluation cover 3 important aspects of the daily job there that you need to know in order to get the position. 

The name of the database you will be working with is: data-analyst-web-store



Step 1:

Queries to know the data:

1. How many customers are there and what is the gender ratio?

2. How many items are there? Do you see any phenomena? (notice that item_id can be different)

3. What is the total amount of orders?

4. How many users were registered in July – December 2019 on the YouTube campaign?

5. How many users from the US bought the book Rich Dad? What is their share out of everyone who bought this book? And what is their share out of all US sales?

6. What is the most ordered item by quantity and what is the item with the highest total revenue? 

7. What is the share of total revenue, orders and users registration for each country, And how this ratio changes from 2019 to 2020 (show results for both years)

8. What is the total of shipments for each category in the data?

9. What is the average of the first order of each customer?

10. Does the membership split equally between gender? Do we get the same result per different countries in the data? Check only for English speaking countries (US, CA and EN)

11. What is the most successful campaign in terms of registrations? And what is the most successful campaign in terms of total revenue brought in?

In [2]:
import pandas as pd
from sqlalchemy import create_engine
import psycopg2

In [3]:
db_config = {'user': 'practicum_student',         # username             
                      'pwd': 's65BlTKV3faNIGhmvJVzOqhs', # password             
                      'host': 'rc1b-wcoijxj3yxfsf3fs.mdb.yandexcloud.net',       #host URL      
                      'port': 6432,              # connection port             
                      'db': 'data-analyst-web-store'}          # the name of the database

connection_string = 'postgresql://{}:{}@{}:{}/{}'.format(db_config['user'],
                                                                     db_config['pwd'],
                                                                       db_config['host'],
                                                                       db_config['port'],
                                                                       db_config['db'])

engine = create_engine(connection_string, connect_args={'sslmode':'require'})

In [4]:
def queryResult(q):
    return pd.io.sql.read_sql(q, con = engine)

In [39]:
query1 = '''
            SELECT gender,COUNT(DISTINCT customer_id)
            FROM customer_info
            GROUP BY gender
         '''
display(queryResult(query1))

   gender  count
0  Female    241
1    Male    218



1. How many customers are there and what is the gender ratio?

In [46]:

query1 = '''
            select
                sum(case when "gender" = 'Male' then 1 else 0 end)/count(*)::float as male_ratio,
                sum(case when "gender" = 'Female' then 1 else 0 end)/count(*)::float as female_ratio,
                sum(customer_id) as total
            from 
                customer_info
         '''
display(queryResult(query1))

   male_ratio  female_ratio   total
0    0.477083      0.522917  117859

2. How many items are there? Do you see any phenomena? (notice that item_id can be different)

3. What is the total amount of orders?

In [60]:
query1 = '''
            select sum(amount) as total_orders
            from order_details
         '''
display(queryResult(query1))

   total_orders
0          3180

4. How many users were registered in July – December 2019 on the YouTube campaign?

In [ ]:
query1 = '''
            
         '''
display(queryResult(query1))

5. How many users from the US bought the book Rich Dad? What is their share out of everyone who bought this book? And what is their share out of all US sales?

In [80]:
query1 = '''
            select sum(amount) as sum_US_total_sales_Rich_Dad
            from 
                items
                left join 
                        (
                        order_details
                        left join 
                                ( 
                                orders
                                left join 
                                        ( 
                                        customer_info
                                        left join countries on countries.country_id = customer_info.country_id
                                        ) as cst_info on cst_info.customer_id = orders.customer_id
                                ) 
                            as cst_orders on cst_orders.order_id = order_details.order_id
                        ) as cst_order_details on cst_order_details.item_id = items.item_id
                where "item" = 'Rich Dad' and "symbol" = 'US'
         '''
# where "item" = 'Rich Dad'
display(queryResult(query1))

   sum_us_total_sales_rich_dad
0                            2

6. What is the most ordered item by quantity and what is the item with the highest total revenue?

In [ ]:
query1 = '''
            
         '''
display(queryResult(query1))


7. What is the share of total revenue, orders and users registration for each country, And how this ratio changes from 2019 to 2020 (show results for both years)

In [231]:
query1 = '''
            select
                country,
                year,
                revenue / sum(revenue) over (partition by year) *100 as revenue_ratio,
                order_cnt / sum(order_cnt) over (partition by year) *100 as ordr_ratio,
                customer_cnt / sum(customer_cnt) over (partition by year) *100 as registration_ratio
            from
                (select 
                        country,
                        sum(price * amount) as revenue,
                        count(distinct cst_order_items.order_id) as order_cnt,
                        count(distinct cst_order_items.customer_id) as customer_cnt,
                        extract(year from date) :: int as year
                from 
                        registration
                        left join (
                                select i.* , cst_order_details.order_id, cst_order_details.country, cst_order_details.customer_id, cst_order_details.amount, cst_order_details.date
                                from 
                                items i
                                left join 
                                        (
                                        select od.* , cst_orders.country, cst_orders.customer_id, cst_orders.date
                                        from order_details od
                                        left join 
                                                (
                                                select orders.* , cst_inf_ct.country
                                                from orders 
                                                left join 
                                                        ( 
                                                        select cst_info.*, countries.country
                                                        from customer_info cst_info
                                                        left join countries on countries.country_id = cst_info.country_id
                                                        ) as cst_inf_ct on cst_inf_ct.customer_id = orders.customer_id
                                                ) as cst_orders on cst_orders.order_id = od.order_id
                                        ) as cst_order_details on cst_order_details.item_id = i.item_id
                                ) as cst_order_items on cst_order_items.customer_id = registration.customer_id
                where extract(year from date) > 2018 and extract(year from date) < 2021
                group by country, year) as final_table
        order by country
         '''


display(queryResult(query1))

          country  year  revenue_ratio  ordr_ratio  registration_ratio
0         Belguim  2019       1.394121    3.797468            3.759398
1         Belguim  2020       6.668262    6.562500            7.027027
2          Canada  2019      17.109629   14.556962           15.789474
3          Canada  2020       9.139087   13.906250           13.513514
4         England  2020       8.048886    5.781250            5.135135
5         England  2019       3.904886    7.594937            6.766917
6          France  2020      11.208516   10.625000           10.000000
7          France  2019      16.037476   10.126582           10.526316
8         Germany  2019       7.728985    6.962025            7.518797
9         Germany  2020      11.706142    8.750000            8.648649
10          Italy  2020      10.487559   10.312500            9.729730
11          Italy  2019       6.233014   10.126582           10.526316
12          Other  2019      10.035778   11.392405           11.278195
13          Other  2020       7.324194    8.437500            9.459459
14       Portugal  2019       8.590762    9.493671            9.774436
15       Portugal  2020       6.891314    7.812500            7.027027
16          Spain  2020       9.893322    9.843750           10.540541
17          Spain  2019       3.563192    9.493671            7.518797
18         Sweden  2020       7.757751    8.593750            8.378378
19         Sweden  2019      15.596542    7.594937            8.270677
20  United States  2020      10.874967    9.375000           10.540541
21  United States  2019       9.805615    8.860759            8.270677


8. What is the total of shipments for each category in the data?

In [ ]:
query1 = '''
            
         '''
display(queryResult(query1))


9. What is the average of the first order of each customer?

In [ ]:
query1 = '''
            
         '''
display(queryResult(query1))


10. Does the membership split equally between gender? Do we get the same result per different countries in the data? Check only for English speaking countries (US, CA and EN)

In [ ]:
query1 = '''
            
         '''
display(queryResult(query1))


11. What is the most successful campaign in terms of registrations? And what is the most successful campaign in terms of total revenue brought in?

In [ ]:
query2 ='''

        '''